
# encoding: utf-8
# language: ru

Функционал: <описание фичи>

Как <Роль>
Я хочу <описание функционала> 
Чтобы <бизнес-эффект> 

Контекст: 
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий


Сценарий: <описание сценария> 

	Когда В панели разделов я выбираю "Кадровый учет"
	И     В панели функций я выбираю "Сотрудники"
	Тогда открылось окно "Сотрудники"
	И     в поле "КомпоновщикНастроекПользовательскиеНастройкиЭлемент4Значение" я ввожу текст "Правительство Москвы"
	И     из выпадающего списка "КомпоновщикНастроекПользовательскиеНастройкиЭлемент4Значение" я выбираю "Правительство Москвы (000000108)"
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Сотрудники"
    И В открытой форме в тч "Список" я перехожу на одну строку вниз
	И     В форме "Сотрудники" в ТЧ "Список" я выбираю текущую строку
	Тогда открылось окно "* (Сотрудник)"
	И     я нажимаю на кнопку "Записать и закрыть"
