
&НаКлиенте
Процедура ПолучитьИзмененияИзГИТ(Команда)
	КомандаСистемы("git log --name-status -100 > D:\Repository\ПереходНа31\git.log", "D:\Repository\ПереходНа31\ХранилищеГит");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзмененияИзГИТ(Команда)
	ДеревоИзменений.ПолучитьЭлементы().Очистить();
	Чтение = Новый ТекстовыйДокумент();
	Чтение.Прочитать("D:\Repository\ПереходНа31\git.log", КодировкаТекста.UTF8);
	
	КоличествоСтрок = Чтение.КоличествоСтрок();
	
	Для СчетчикСтрок = 1 По КоличествоСтрок Цикл
		
		СтрокаДляОбработки = Чтение.ПолучитьСтроку(СчетчикСтрок);
		Если СтрНачинаетсяС(СтрокаДляОбработки, "Date:") Тогда
			
			СчетчикСтрок = СчетчикСтрок + 2;
			ТекстКоммита = СокрЛП(Чтение.ПолучитьСтроку(СчетчикСтрок));
			СчетчикСтрок = СчетчикСтрок + 2;
			
			СтрокаСИзменениями = "";
			
			СтрокаДляОбработки = Чтение.ПолучитьСтроку(СчетчикСтрок);
			Пока Не СокрЛП(СтрокаДляОбработки) = "" Цикл
				Если СтрокаСИзменениями = "" Тогда
					СтрокаСИзменениями = СтрокаДляОбработки;
				Иначе
					СтрокаСИзменениями = СтрокаСИзменениями + Символы.ПС + СтрокаДляОбработки;
				КонецЕсли;
				СчетчикСтрок = СчетчикСтрок + 1;
				СтрокаДляОбработки = Чтение.ПолучитьСтроку(СчетчикСтрок);
				
				
				
			КонецЦикла;
			ОбработатьСписокИзменений(ТекстКоммита, СтрокаСИзменениями);
			
		Иначе
			Продолжить;
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ОбработатьСписокИзменений(ТекстКоммита, СтрокаСИзменениями)
	
	
	
	НадоСоздаватьКоммит = Истина;
	Для Каждого ТекЗадача Из ДеревоИзменений.ПолучитьЭлементы() Цикл
		
		Если ТекЗадача.Комментарий = ТекстКоммита Тогда
			
			НадоСоздаватьКоммит = Ложь;
			НадоДобавлятьИзменение = Истина;
			
			Для Счетчик = 1 По СтрЧислоСтрок(СтрокаСИзменениями) Цикл
				
				НадоДобавлятьИзменение = Истина;
				СтрокаДляОбработки = СтрПолучитьСтроку(СтрокаСИзменениями, Счетчик);
				СтрокаДляОбработки = СтрЗаменить(СтрокаДляОбработки, Символы.Таб, Символы.ПС);
				Атрибут = СтрПолучитьСтроку(СтрокаДляОбработки, 1);
				ИмяФайла = СтрПолучитьСтроку(СтрокаДляОбработки, 2);
				
				
				
				Для Каждого ТекИзменение Из ТекЗадача.ПолучитьЭлементы() Цикл
					
					Если ТекИзменение.Комментарий = ИмяФайла И ТекИзменение.Атрибут = Атрибут Тогда
						НадоДобавлятьИзменение = Ложь;
						Прервать;
					КонецЕсли;
					
					
					
				КонецЦикла;
				
				Если НадоДобавлятьИзменение Тогда
					НоваяСтрока = ТекЗадача.ПолучитьЭлементы().Добавить();
					НоваяСтрока.Комментарий = ИмяФайла;
					НоваяСтрока.Атрибут = Атрибут;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЦикла;
	Если НадоСоздаватьКоммит Тогда
		
		НоваяЗадача = ДеревоИзменений.ПолучитьЭлементы().Добавить();
		НоваяЗадача.Комментарий = ТекстКоммита;
		Для Счетчик = 1 По СтрЧислоСтрок(СтрокаСИзменениями) Цикл
			
			НадоДобавлятьИзменение = Истина;
			СтрокаДляОбработки = СтрПолучитьСтроку(СтрокаСИзменениями, Счетчик);
			СтрокаДляОбработки = СтрЗаменить(СтрокаДляОбработки, Символы.Таб, Символы.ПС);
			Атрибут = СтрПолучитьСтроку(СтрокаДляОбработки, 1);
			ИмяФайла = СтрПолучитьСтроку(СтрокаДляОбработки, 2);
			
			
			
			
			Если НадоДобавлятьИзменение Тогда
				НоваяСтрока = НоваяЗадача.ПолучитьЭлементы().Добавить();
				НоваяСтрока.Комментарий = ИмяФайла;
				НоваяСтрока.Атрибут = Атрибут;
			КонецЕсли;
		КонецЦикла;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиИзменения(Команда)
	
	Для СчетчикСтрок = 1 По СтрЧислоСтрок(СписокИзмененийНаЗагрузку) Цикл
		
		СтрокаДляОбработки = СтрПолучитьСтроку(СписокИзмененийНаЗагрузку, СчетчикСтрок);
		ОбработатьИзменение(СтрокаДляОбработки);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокИзмененийНаЗагрузку = "00-00017347";
КонецПроцедуры

Процедура ОбработатьИзменение(СтрокаДляОбработки)
	
	
	Для Каждого ТекСтрока Из ДеревоИзменений.ПолучитьЭлементы() Цикл
		
		Если ТекСтрока.Комментарий = СтрокаДляОбработки Тогда
			
			
			
			Для Каждого ТекИзменение Из ТекСтрока.ПолучитьЭлементы() Цикл
				
				Если ТекИзменение.Комментарий = "VERSION" Тогда
					Продолжить;
				КонецЕсли;
				Если ТекИзменение.Комментарий = "renames.txt" Тогда
					Продолжить;
				КонецЕсли;
				Если ТекИзменение.Комментарий = "Configuration.xml" Тогда
					Продолжить;
				КонецЕсли;
				ИмяФайлаНаИзменение = ТекИзменение.Комментарий;
				ПутьКФайлу = СтрЗаменить(ИмяФайлаНаИзменение, "/", Символы.ПС);
				ПутьКФайлуПриемник = "";
				ПутьКФайлуИсточник = "";
				Для СчетчикПутиКФайлу = 1 По СтрЧислоСтрок(ПутьКФайлу) Цикл
					
					Если СчетчикПутиКФайлу = 1 Тогда
						ПутьКФайлуПриемник = "D:\Repository\test\Update\ReleasePromGit\" + СтрПолучитьСтроку(ПутьКФайлу, СчетчикПутиКФайлу);
						ПутьКФайлуИсточник = "D:\Repository\test\Update\ReleaseDevTest\" + СтрПолучитьСтроку(ПутьКФайлу, СчетчикПутиКФайлу);
					Иначе
						Если СчетчикПутиКФайлу = 2 Тогда
							ДобавитьВСписокОбъектов(СтрПолучитьСтроку(ПутьКФайлу, 1), СтрПолучитьСтроку(ПутьКФайлу, 2));
						КонецЕсли;
						ПутьКФайлуПриемник = ПутьКФайлуПриемник + "\" + СтрПолучитьСтроку(ПутьКФайлу, СчетчикПутиКФайлу);
						ПутьКФайлуИсточник = ПутьКФайлуИсточник + "\" + СтрПолучитьСтроку(ПутьКФайлу, СчетчикПутиКФайлу);
					КонецЕсли;	
					КаталогНаДиске = Новый Файл(ПутьКФайлуПриемник);
					Если Не КаталогНаДиске.Существует() Тогда
						
						Если СчетчикПутиКФайлу = СтрЧислоСтрок(ПутьКФайлу) Тогда
							Продолжить;
						Иначе
							СоздатьКаталог(ПутьКФайлуПриемник);
						КонецЕсли;
						
						
					КонецЕсли;
					
					
				КонецЦикла;
				КопироватьФайл(ПутьКФайлуИсточник, ПутьКФайлуПриемник);
				
			КонецЦикла;
			
			
			
			Прервать;
		КонецЕсли;
		
		
	КонецЦикла;
	Для Каждого ЭлементПроверки Из СписокОбъектовКоторыеНадоПроверить Цикл
		
		СтрокаДляОбработки = СтрЗаменить(ЭлементПроверки.Значение, "/", Символы.ПС);
		ГруппаЭлемента = СтрПолучитьСтроку(СтрокаДляОбработки, 1);
		ГруппаЭлемента = ПреобразоватьГруппуЭлемента(ГруппаЭлемента);
		Элемент = СтрПолучитьСтроку(СтрокаДляОбработки, 2);
		
		Чтение = Новый ТекстовыйДокумент;
		Чтение.Прочитать("D:\Repository\test\Update\ReleasePromGit\Configuration.xml", КодировкаТекста.UTF8);
		НайденаГруппаЭлемента = Ложь;
		Записывать = Ложь;
		Для Счетчик = 1 По Чтение.КоличествоСтрок() Цикл
			
			СтрокаДляОбработки = Чтение.ПолучитьСтроку(Счетчик);
			Если СтрНачинаетсяС(СокрЛП(СтрокаДляОбработки), СтрШаблон("<%1>", ГруппаЭлемента)) Тогда
				НайденаГруппаЭлемента = Истина;
				Если СокрЛП(СтрокаДляОбработки) = СтрШаблон("<%1>%2</%1>", ГруппаЭлемента, Элемент) Тогда
					Прервать;
				КонецЕсли;
				
			Иначе
				Если НайденаГруппаЭлемента Тогда
					Чтение.ВставитьСтроку(Счетчик, СтрШаблон("<%1>%2</%1>", ГруппаЭлемента, Элемент));
					Записывать = Истина;
					Прервать;
				КонецЕсли;
				
				
			КонецЕсли;
			
		КонецЦикла;
		Если Записывать Тогда
			Чтение.Записать("D:\Repository\test\Update\ReleasePromGit\Configuration.xml", КодировкаТекста.UTF8);
		КонецЕсли;
		
		
		
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ДобавитьВСписокОбъектов(Группа, ИмяОбъекта)
	ОбъектДляДобавления = ИмяОбъекта;
	Если СтрЗаканчиваетсяНа(ИмяОбъекта, ".xml") Тогда
		ОбъектДляДобавления = Лев(ИмяОбъекта, СтрДлина(ИмяОбъекта) - 4);
	КонецЕсли;
	Если СписокОбъектовКоторыеНадоПроверить.НайтиПоЗначению(Группа + "/" + ОбъектДляДобавления) = Неопределено Тогда
		
		СписокОбъектовКоторыеНадоПроверить.Добавить(Группа + "/" + ОбъектДляДобавления);
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПреобразоватьГруппуЭлемента(ГруппаЭлемента)
	
	Если СтрЗаканчиваетсяНа(ГруппаЭлемента, "s") Тогда
		Возврат Лев(ГруппаЭлемента, СтрДлина(ГруппаЭлемента) - 1);
	Иначе
		Возврат ГруппаЭлемента;
	КонецЕсли;
	
	//Если ГруппаЭлемента = "Reports" Тогда
	//	Возврат "Report"
	//КонецЕсли;
	//Если ГруппаЭлемента = "Subsystems" Тогда
	//	Возврат "Subsystem"
	//КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура ВычестьИзменения(Команда)
	ВычестьИзмененияНаСервере();
КонецПроцедуры

Процедура ВычестьИзмененияНаСервере()
	
	ДЗ = РеквизитФормыВЗначение("ДеревоИзменений");
	НачальныеСтроки = ДЗ.Строки.Найти("Создание хранилища конфигурации");
	НачальныйСписок = НачальныеСтроки.Строки.ВыгрузитьКОлонку("Комментарий");
	Для Каждого ТекСтрока Из  ДЗ.Строки Цикл
		
		Если ТекСтрока.Комментарий = "Создание хранилища конфигурации" Тогда Продолжить;
		КонецЕсли;
		Для Каждого ТекИзменение ИЗ ТекСтрока.Строки Цикл
			
			НайденныйИндекс = НачальныйСписок.Найти(ТекИзменение.Комментарий);
			Если Не НайденныйИндекс = Неопределено Тогда
				НачальныйСписок.Удалить(НайденныйИндекс);
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
	КонецЦикла;
	СписокОбъектовДляИзменения.ЗагрузитьЗначения(НачальныйСписок);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИзменения(Команда)
	ЗагрузитьИзмененияНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьИзмененияНаСервере()
	СписокОбъектовДляИзменения.ЗагрузитьЗначения(ЗначениеИзФайла("D:\Repository\ПереходНа31\1.xml"));
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьИзменения(Команда)
	ВыгрузитьИзмененияНаСервере();
КонецПроцедуры


&НаСервере
Процедура ВыгрузитьИзмененияНаСервере()
	ЗначениеВФайл("D:\Repository\ПереходНа31\1.xml", СписокОбъектовДляИзменения.ВыгрузитьЗначения());
КонецПроцедуры


&НаКлиенте
Процедура СравнениеФайлов1Этап(Команда)
	СравнениеФайлов1ЭтапНаСервере();
КонецПроцедуры


&НаСервере
Процедура СравнениеФайлов1ЭтапНаСервере()
	ИсходныйКаталог = "\\10.126.220.23\гаманец\scr";
	ТаблицаСравнения.Очистить();
	Для Каждого ТекСтрока Из СписокОбъектовДляИзменения Цикл
		
		Если ТекСтрока.Значение = "AUTHORS" Тогда
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтрока = ТаблицаСравнения.Добавить();
		НоваяСтрока.Файл = ТекСтрока.Значение;
		Файл1 = ИсходныйКаталог + "\Начальная\" + ТекСтрока.Значение;
		Файл2 = ИсходныйКаталог + "\ТекущаяУГСК\" + ТекСтрока.Значение;
		Файл3 = ИсходныйКаталог + "\31\" + ТекСтрока.Значение;
		ФайлНаДиске = Новый Файл(Файл1);
		Если Не  ФайлНаДиске.Существует() Тогда
			НоваяСтрока.Отсутствует = Истина;
			
			Продолжить;
		КонецЕсли;
		ФайлНаДиске = Новый Файл(Файл2);
		Если Не  ФайлНаДиске.Существует() Тогда
			НоваяСтрока.Отсутствует = Истина;
			Продолжить;
		КонецЕсли;
		ФайлНаДиске = Новый Файл(Файл3);
		Если Не  ФайлНаДиске.Существует() Тогда
			НоваяСтрока.Отсутствует = Истина;
			Продолжить;
		КонецЕсли;
		Хэш1 = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хэш1.ДобавитьФайл(Файл1);
		ХэшСумма1 = Хэш1.ХешСумма;
		Хэш2 = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хэш2.ДобавитьФайл(Файл2);
		ХэшСумма2 = Хэш2.ХешСумма;
		Хэш3 = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хэш3.ДобавитьФайл(Файл3);
		ХэшСумма3 = Хэш3.ХешСумма;
		Если ХэшСумма1 = ХэшСумма2 И ХэшСумма2 = ХэшСумма3 Тогда
			НоваяСтрока.НеИзменен = Истина;
		ИначеЕсли ХэшСумма1 = ХэшСумма3 И Не ХэшСумма2 = ХэшСумма3 Тогда
			НоваяСтрока.ИзмененНами = Истина;
		ИначеЕсли ХэшСумма1 = ХэшСумма2 И Не ХэшСумма2 = ХэшСумма3 Тогда
			НоваяСтрока.ИзмененТолькоВНовомРелизе = Истина;
		ИначеЕсли Не ХэшСумма1 = ХэшСумма2 И Не ХэшСумма2 = ХэшСумма3 Тогда
			НоваяСтрока.ИзмененДважды = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура НачатьСравнение(Команда)
	НачатьСравнениеНаСервере();
КонецПроцедуры


&НаСервере
Процедура НачатьСравнениеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьИзмененныеНами(Команда)
	СкопироватьИзмененныеНамиНаСервере();
КонецПроцедуры


&НаСервере
Процедура СкопироватьИзмененныеНамиНаСервере()
	ТЗДляОбработки = ПолучитьТЗИзМакета(РеквизитФормыВЗначение("Объект").ПолучитьМакет("ИзмененныеНами"));
	
	ИсходныйКаталог = "\\10.126.220.23\гаманец\scr";
	
	
	Для Каждого ТекСтрока Из ТЗДляОбработки Цикл
		
		Файл2 = ИсходныйКаталог + "\ТекущаяУГСК\" + ТекСтрока.Файл;
		ФайлНазначения =  ИсходныйКаталог + "\ПереходНа31_1\" + ТекСтрока.Файл;
		КопироватьФайл(Файл2, ФайлНазначения);
		
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьТЗИзМакета(ТабДок, КолонкаИндекса = 1) Экспорт
	
	
	
	
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	
	НомерКолонки = 0;
	
	
	Пока Истина Цикл
		
		
		НомерКолонки = НомерКолонки + 1;
		
		
		ИмяКолонки = ТабДок.Область(1, НомерКолонки).Текст;
		
		
		Если ПустаяСтрока(ИмяКолонки) Тогда
			
			
			Прервать;
			
			
		КонецЕсли; 
		
		
		ТаблицаДанных.Колонки.Добавить(ИмяКолонки);
		
		
	КонецЦикла;
	
	
	
	
	
	СчетчикКолонок = НомерКолонки - 1;
	
	
	
	
	
	НомерСтроки = 1; ФлагПрерывания = Ложь;
	
	
	Пока Истина Цикл
		
		
		НомерСтроки = НомерСтроки + 1;
		
		
		Стр = ТаблицаДанных.Добавить();
		
		
		
		
		
		Для А = 1 ПО СчетчикКолонок Цикл
			
			
			ТекстКолонки = ТабДок.Область(НомерСтроки, А).Текст;
			
			
			Если ПустаяСтрока(ТекстКолонки) Тогда
				
				
				Если А = КолонкаИндекса Тогда
					
					
					Флагпрерывания = Истина;
					
					
					ТаблицаДанных.Удалить(Стр);
					
					
				КонецЕсли;
				
				
			Иначе
				
				
				Стр[А - 1] = ТекстКолонки
				
				
			КонецЕсли;
			
			
			
			
			
			Если Флагпрерывания Тогда
				
				
				Прервать
				
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		
		
		Если Флагпрерывания Тогда
			
			
			Прервать
			
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
	
	
	Возврат ТаблицаДанных
	
	
КонецФункции



&НаКлиенте
Процедура ЗагрузитьДваждыИзмененные(Команда)
	ЗагрузитьДваждыИзмененныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДваждыИзмененныеНаСервере()
	СписокИзмененных.ЗагрузитьЗначения(ПолучитьТЗИзМакета(РеквизитФормыВЗначение("Объект").ПолучитьМакет("ИзмененныеДважды")).ВыгрузитьКолонку("Файл"));
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСравнение(Команда)
	ТекущийФайл = Элементы.СписокИзмененных.ТекущиеДанные;
	ИсходныйКаталог = "\\10.126.220.23\гаманец\scr";
		Файл1 = ИсходныйКаталог + "\Начальная\" + ТекущийФайл.Значение;
		Файл2 = ИсходныйКаталог + "\ТекущаяУГСК\" + ТекущийФайл.Значение;
		Файл3 = ИсходныйКаталог + "\31\" + ТекущийФайл.Значение;
		ФайлК = ИсходныйКаталог + "\ПереходНа31_2\" + ТекущийФайл.Значение;
КомандаСистемы(СтрШаблон("kdiff3 ""%1"" ""%2"" ""%3"" -o ""%4"" --qall", Файл1, Файл2, Файл3, ФайлК), "D:\Program Files\KDiff3"); 	
ТекущийФайл.Пометка = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДваждыИзмененных(Команда)
	ЗаписатьДваждыИзмененныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДваждыИзмененныхНаСервере()
	ЗначениеВФайл("D:\Repository\ПереходНа31\2.xml", СписокИзмененных);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДваждыИзмененных2(Команда)
	ЗагрузитьДваждыИзмененных2НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДваждыИзмененных2НаСервере()
	СписокИзмененных = ЗначениеИзФайла("D:\Repository\ПереходНа31\2.xml");
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьИзмененныеВНовомРелизе(Команда)
	СкопироватьИзмененныеВНовомРелизеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СкопироватьИзмененныеВНовомРелизеНаСервере()
	ТЗДляОбработки = ПолучитьТЗИзМакета(РеквизитФормыВЗначение("Объект").ПолучитьМакет("ИзмененыВНовомРелизе"));
	
	ИсходныйКаталог = "\\10.126.220.23\гаманец\scr";
	
	
	Для Каждого ТекСтрока Из ТЗДляОбработки Цикл
		Если СтрНачинаетсяС(ТекСтрока.Файл, ОтборИзмененныхВНовомРелизе) Тогда
		Файл2 = ИсходныйКаталог + "\31\" + ТекСтрока.Файл;
		ФайлНазначения =  ИсходныйКаталог + "\ПереходНа31_1\" + ТекСтрока.Файл;
		КопироватьФайл(Файл2, ФайлНазначения);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
